# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO11n with P2/4 high-resolution detection head

nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 ← 🔸 P2 feature map (H/4)
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with P2
head:
  # 🔹 FPN: P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4 (index 6)
  - [-1, 2, C3k2, [512, False]] # 13

  # 🔹 FPN: P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3 (index 4)
  - [-1, 2, C3k2, [256, False]] # 16

  # 🔹 🔸 FPN: P3 → P2 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # upsample P3 → P2
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2 (index 1)
  - [-1, 1, C3k2, [128, False]] # 19 ← P2 detection head

  # 🔹 PAN: P2 → P3
  - [-1, 1, Conv, [128, 3, 2]] # downsample P2 → P3
  - [[-1, 16], 1, Concat, [1]] # cat FPN P3 (index 16)
  - [-1, 1, C3k2, [256, False]] # 22

  # 🔹 PAN: P3 → P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat FPN P4 (index 13)
  - [-1, 2, C3k2, [512, False]] # 25

  # 🔹 PAN: P4 → P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat backbone P5 (index 10)
  - [-1, 2, C3k2, [1024, True]] # 28

  # 🔹 Detection Head: P2, P3, P4, P5 (4 outputs)
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)